/****************************************************************
 *                                    *
 * Problem : 주어진정수의최대최소구하기                     *
 *                                    *
 ***************************************************************/
 
 /***************************************************************
 *                                                                                  *
 * 국민대학교 소프트웨어융합대학 소프트웨어학부              *
 *                                          20163092 김상윤              *
 ***************************************************************/
#include <iostream>
using namespace std;

int main() {
    int T;
    cin >> T;
    for (int i = 0 ; i < T ; i++) {
        int cnt, max, min, x;
        int answer = 0;
        cin >> cnt;
        cin >> x;
        max = x;
        min = x;
        for (int j = 0 ; j < cnt-1 ; j++) {
            int y;
            cin >> y;
            if (y > max)
                max = y;
            else if (y < min)
                min = y;
        }
        cout << max << " " << min << endl;
    }
    return 0;
}
